#ഓരോ മാറ്റവും ഗ്രന്ഥപെട്ടിയിലും നാഗരിപെട്ടിയിലും വെവ്വേറെ ചെയ്യേണ്ടി വരാതിരിക്കാൻ തയ്യാറാക്കിയത്. ഞാൻ കൂടുതൽ ഉപയോഗിക്കുന്നതും ഭാഷയിൽ കൂടുതൽ സങ്കീർണമായതും [കൂടുതൽ അക്ഷരങ്ങൾ ഉള്ളവ] നാഗഗ്രന്ഥ ലിപിയായതിനാൽ യാഥാർത്ഥത്തിൽ നാഗഗ്രന്ഥയിൽ നിന്ന് ദേവനാഗരിയാക്കുന്നതാണ് രണ്ടുലിപിയും അറിയുന്നവർക്ക് യുക്തി.
# ഓല - file. താളി - folder. പാകുക - coding. അക്ഷരപെട്ടി - keyboard. അരൂപ/അരൂപി - digital.

#ബ്രാഹ്മിഭാഷപാക‍ൽ-ലേക്ക് മാറ്റുക. 
# ഗ്രന്ഥത്തിൽ നിന്ന് നാഗരിയിലേക്ക് മാറ്റുക.


# ദേവനാഗരിയിൽ നിന്ന് മലയാളത്തിലേക്കുള്ള പൊരുത്ത-നിഘണ്ടു
സാധാരണാക്ഷരം = {
    # സംഖ്യകൾ
    '൦': '०', '൧': '१', '൨': '२', '൩': '३', '൪': '४', '൫': '५', '൬': '६', '൭': '७', '൮': '८', '൯': '९', #ഇത് ഉപയോഗിക്കാതിരുക്കുന്നതാണ് ഉചിതം എന്തെന്നാൽ 1,2,3 എന്നിവ ബ്രാഹ്മി ലിപിയാണ് (ഗ്രന്ഥത്തിൻറ്റെയും, നാഗരിയുടേയും അമ്മ), ഇത് ലോകം മൊത്തം സ്വീകരിച്ചിരിക്കുന്നു. അതിനാൽ ഇത് നമ്മുടെ വിജയം കണക്കാക്കി ഇത് തന്നെ ഉപയോഗിക്കുക.

    # സ്വരാക്ഷരങ്ങൾ
    'അ': 'अ', 'ആ': 'आ', 'ഇ': 'इ', 'ഈ': 'ई', 'ഉ': 'उ', 'ഊ': 'ऊ',
    'ഋ': 'ऋ', 'ൠ': 'ॠ', 'ഌ': 'ऌ', 'ൡ': 'ॡ', 
    'ഏ': 'ऎ', 'എ': 'ए', 'ഐ': 'ऐ', #ഇതിൽ ദേവനാഗരിയിലെ എ-യും ഏ-യും പരസ്പരം തിരിച്ചിടുണ്ട്. പക്ഷെ ഇത് നാഗരിക്കാർ ഉപയോഗിക്കാത്തത് കൊണ്ട് ഗ്രന്ഥക്കാർക്ക് പെട്ടെന്ന് മനസ്സിലാവാൻ വേണ്ടി ചെയ്തതാണ്.
    'ഒ': 'ओ', 'ഓ': 'ऒ', 'ഔ': 'औ', #മുമ്പ് ഒ, ഓ എന്നിവ തിരിച്ചായിരുന്നു. ഇപ്പോൾ ഇങ്ങനെയാക്കി.
    'അം': 'अं', 'അഃ': 'अः', #ഇത് വായിക്കാൻ സാധ്യതയി‍ല്ല, എന്തെന്നാ‍ൽ രണ്ടക്ഷരം
    
    # വ്യഞ്ജനാക്ഷരങ്ങൾ
    'ക': 'क', 'ഖ': 'ख', 'ഗ': 'ग', 'ഘ': 'घ', 'ങ': 'ङ', #കണ്ഠ്യം
    'ച': 'च', 'ഛ': 'छ', 'ജ': 'ज', 'ഝ': 'झ', 'ഞ': 'ञ', #താലവ്യം
    'ട': 'ट', 'ഠ': 'ठ', 'ഡ': 'ड', 'ഢ': 'ढ', 'ണ': 'ण', #മൂർദ്ധന്യം
    #(വർത്സ്യം താഴെ ഉണ്ട്.)
    'ത': 'त', 'ഥ': 'थ', 'ദ': 'द', 'ധ': 'ध', 'ന': 'न', #ദന്ത്യം
    'പ': 'प', 'ഫ': 'फ', 'ബ': 'ब', 'ഭ': 'भ', 'മ': 'म', #ഓഷ്ഠ്യം
    
    # വർത്സ്യവ്യഞ്ജനം
    'ഺ': 'ഺ', #മാറ്റമില്ലെങ്കിലും അറിയാനായ്. സ്വരചിഹ്നം ഉപയോഗിക്കാനുള്ള സംവിധാനം അരൂപികളിൽ ഇല്ല. വർത്സ്യഖരം.
    'ഩ': 'ऩ', #ഇത് UniCodeൽ ഉണ്ടെങ്കിലും അരൂപികളിൽ പലതും സ്വരചിഹ്നത്തോട് ചേർക്കാൻ സമ്മതിക്കുന്നില്ല. വർത്സ്യാനുനാസിക. എന്നിരുന്നാലും ൻ എന്നതിനോട് ബന്ധിപ്പിച്ചിട്ടുണ്ട്.
    
    # മലയാളത്തിൽ വ്യഞ്ജനാക്ഷരവർഗങ്ങളിൽ ദന്ത്യക്ക് (ത) മുമ്പ് വരുന്നതാണ് വർത്സ്യം. അതിലുള്ള ഖരാക്ഷരം (ത പോലെ) ആണ് ഺ. അതിൽ അനുനാസികം (ന പോലെ) ആണ് ഩ. മറ്റു മൂന്നെണ്ണം (അതിഖരം, മൃദു, ഘോഷം) ഈ വർത്സ്യവർഗത്തിൽ ഇല്ല. ഺ എന്നതിനെയാണ് നമ്മൾ റ്റ എന്ന് വച്ച് എഴുതുന്നത്. ഩ എന്നത് ഇപ്പോൾ ഒരു നിയമം മാത്രമാക്കി, അതായത് ശബ്ദത്തിൻറ്റെ തുടക്കത്തിൽ വന്നാൽ ന എന്നും, തുടക്കത്തിൽ അല്ലെങ്കിൽ ന എന്ന് എഴുതിയാലും ഩ എന്ന് ഉച്ഛരിക്കണം എന്നും. അഥവ ന എന്ന ഉച്ഛാരണം തന്നെ വേണമെങ്കിൽ രണ്ട് ന (ന്ന) ഒരുമിച്ച് എഴുതണം. പക്ഷെ ഈ നിയമം മാത്രം പോര, എന്തെന്നാൽ 'എൻഩെ' (എനിക്ക് എന്ന രീതിയിൽ അർഥം) എന്നതും 'എന്നെ' (എപ്പോഴെ എന്ന അർഥം) എന്നതും വേറെയാണ്. അത് പോലെ, എൻഩാൽ (എന്ഩെകൊണ്ട് എന്ന അർഥം) എന്നാൽ (പക്ഷെ എന്ന് അർഥം) എന്നതും വേറെയാണ്.
    
    
    'യ': 'य', 'ര': 'र', 'ല': 'ल', 'വ': 'व', #സ്വരവ്യഞ്ജനമധ്യമങ്ങൾ
    'ശ': 'श', 'ഷ': 'ष', 'സ': 'स', #ഊഷ്മാക്കൾ
    'ഹ': 'ह', #ഘോഷി
    'ഴ': 'ऴ', 'റ': 'ऱ', 'ള': 'ळ', #ജിഹ്വ്യം (ഇങ്ങനെയല്ല ഇതിനെ പൊതുവെ വിളിക്കുന്നത്, പക്ഷെ ജിഹ്വ വളക്കുന്നതാണ് ഇതിൽ പ്രധാനം)
    
    # കൂട്ടക്ഷരങ്ങൾ
    'ക്ഷ': 'क्ष', 'ത്ര': 'त्र', 'ജ്ഞ': 'ज्ञ', #ഇത് പാകൽ കാരണം മാറുന്നതാവില്ല, സ്വയം മാറുന്നതാവാം. എന്തെന്നാൽ ഒന്നിന് ഒന്ന് എന്നതാണ് ഈ കെട്ടിനുള്ള പാകൽ യുക്തി. അപ്പോൾ ഇത് വായിക്കാതെ പാകൽ നടക്കുന്നുണ്ടാവും.
    

    # മാത്രകൾ (സ്വരാക്ഷര ചിഹ്നങ്ങൾ)
    'ാ': 'ा', 'ി': 'ि', 'ീ': 'ी', 'ു': 'ु', 'ൂ': 'ू', 'ൃ': 'ृ', 'ൄ': 'ॄ',
    'േ': 'ॆ', 'െ': 'े', 'ൈ': 'ै', 'ൊ': 'ो', 'ോ': 'ॊ', #മുമ്പ് ൊ, ോ എന്നിവ തിരിച്ചായിരുന്നു.
    'ൗ': 'ौ','ൌ': 'ौ',    #നാഗഗ്രന്ഥയിലെ രണ്ടു തരം 'ൌ' ചേർക്കുന്നു. രണ്ടാമത്തേത് "കൌ" എന്നതാണ്.
    'ം': 'ं', 'ഃ': 'ः', 
    'ഽ': 'ऽ',

    '്': '्', # അക്ഷര വിരാമം  
    'ഁ': 'ँ', # ചന്ദ്രബിന്ദു. ഇങ്ങനെയും എഴുതാം -> '\u0D01': '\u0901',
        
    # പ്രത്യേകാക്ഷരങ്ങൾ
    '':'ऺ',  # വെറുതെ ആണ്. എന്തിനാണെന്ന് ഓർമയില്ല.
    '‍': '' # ശൂന്യ വലുപ്പമുള്ള പ്രതീകം. എന്തിനാ͏ണെന്ന് ഓർമയില്ല.
}

ചില്ലക്ഷരം = {
    #ചില്ലക്ഷരങ്ങൾ
    'ൿ': 'क़्', 'ൕ': 'य़्', 'ൖ': 'ऴ़्', #ഇവയിൽ എല്ലാം നുക്തം ഉണ്ട്. ഇത് കൂടാതെ ഇതിൽ ഒരെണ്ണം കൂടെ ഉണ്ടായിരുന്നു --> # 'ം': 'म़्',
    
    'ൻ': 'ऩ्', 'ൺ': 'ण़्', # 'ൻ': 'ऩ्' എന്നതിന് പകരം. രണ്ടും വേറെ വേറെ ആണ്. ഒന്നിൽ നുക്തം, മറ്റേത് സ്വതവേ.
    'ർ':'र्', 
    
    'ൾ': '‍ळ्', #മലയാളത്തിൽ ചെറിയ മാഺം. എന്തെന്നാൽ നമ്മൾ കൂടുതലും ൽ, ൾ ആണ് ഉപയോഗിക്കുന്നത്.
    'ൽ': 'ल्', # സാധാരണ
    '‍ൽ': '‍ल्' #ZWJ ഉണ്ട്.ചിലപ്പോൾ ഈ വരി ആവശ്യമില്ലായിരിക്കാം. അല്ലെങ്കിൽ ഇതിനെ ल़्' എന്നൊ മാറ്റാം.
}

ചില്ലല്ലാഽക്ഷരം = { 
    #രണ്ടക്ഷരമായവക്ക് വേണ്ടി.
    'ര്':'ऱ्', 
    'ള്': '‍ऴ्', #മുമ്പ് ഇതും ഉണ്ടായിരുന്നു --> 'ല്': '‍ल़्'
}

നുക്താക്ഷരം = { 
    # ஃ എന്നത് തമിഴിലെ ഉള്ളു. മലയാളത്തിൽ ഉള്ളതൊന്നും അരൂപിയിൽ പ്രവർത്തിക്കുന്നില്ല. നുക്തം എന്ന ഭാഗത്തിന് മുമ്പേ പാകണം. 
    'ஃവ': 'व़', # ചുണ്ട് പുറത്തേക്കാക്കി കൂട്ടിപിടിച്ച് പറയുന്ന വ (w). മറ്റേത് മുകളിലത്തെ പല്ലുകൾ താഴത്തെ ചുണ്ടിൽ മുട്ടിച്ച് പറയുന്നു (v). ഇത് നേപാളിൽ ഉപയോഗിക്കും.
    'ஃസ': 'ज़', # ജ്സ എന്നാണ് വായിക്കുക. ഈ ശബ്ദമുള്ള വാക്ക് ഹിന്ദിയിൽ കേട്ടാൽ അതിനർഥം അത് ശുദ്ധഹിന്ദി അല്ലെന്നും പാഴ്സിയൊ, അറബികൊ ആണെന്നും അർഥം.
    'ஃഫ': 'फ़', #പുറത്തേക്ക് ഊതി 'വ' എന്ന് പറയുന്ന ഉച്ഛാരണം. വേണമെങ്കിൽ ஃഫ എന്നതിന് '൧' ും ഉപയോഗിക്കാം. 
    'ஃയ': 'य़', #ൕ എന്ന ചില്ലക്ഷരവും ഉപയോഗിക്കാം. ഇതിൽ സ്വരചിഹ്നങ്ങളും സാധ്യമാണ്. പക്ഷെ ചില അരൂപികളിൽ ഇത് വായിക്കപെടാത്തത് കൊണ്ട്, നമുക്ക് ஃ ഉപയോഗിക്കേണ്ടി വരുന്നു. ഈ ശബ്ദം നേപാളിലേതാണ്.
}

നുക്തം = {
    '​': '़'  #'\u093C' നെ Zero Width Space (ZWS) ആയി മാറ്റുന്നു. व़ (വ), फ़(ഫ), य़ (ൕ) എന്നിവയെ ഭാവിയിൽ തിരിച്ചു മാറ്റാൻ, ഇതെങ്ങാനും ഉപയോഗിക്കുന്നവർ ഉണ്ടെങ്കിൽ. ഇങ്ങനെ നുക്തത്തിന് പകരം ഉപയോഗിക്കാൻ അക്ഷരമില്ലാത്തത് ബുദ്ധിമുട്ടാണ്. നമുക്ക് സ്വന്തമായി UniCodeന് പകരക്കാരൻ ഉണ്ടാക്കേണം.
    
    # ഈ ZWJ, ZWSP, CGJനെ പറ്റിയൊക്കെ അറിയാൻ  - https://learn.microsoft.com/en-us/typography/script-development/malayalam
}





import os

# നിലവിലെ പ്രവർത്തന സ്ഥാനം അച്ചടിക്കുക
print("നിലവിലെ പ്രവർത്തന സ്ഥാനം:", os.getcwd())

# ഈ .bundle എന്ന താളിയുള്ള പാത നൽകുക.
bundle_പാത = os.path.dirname(os.path.abspath(__file__))

# നിക്ഷേപ & പരിണാമ ഓലകളുടെ പൂർണ്ണ പാത
നിക്ഷേപതാളി = os.path.join(bundle_പാത, 'सरळसंस्कृतं.bundle/Contents/Resources/നാഗഗ്രന്ഥ.keylayout')
പരിണാമതാളി = os.path.join(bundle_പാത, 'सरळसंस्कृतं.bundle/Contents/Resources/सरळनागरि.keylayout')

def അക്ഷരപെട്ടി_പേരുമാഺം(ഉള്ളടക്കം):
    return ഉള്ളടക്കം.replace("നാഗഗ്രന്ഥ", "सरळनागरि")

def ലിപി_മാഺം(വാചകം):
    result = ""
    i = 0
    while i < len(വാചകം):
        # ചില്ലക്ഷരങ്ങളായി മാറുന്ന ദേവനാഗരി അക്ഷരകെട്ടിന് മൂന്നക്ഷരം ഉണ്ട്
        if വാചകം[i] in ചില്ലക്ഷരം:
            result += ചില്ലക്ഷരം[വാചകം[i]]
            i += 1
        # ‍ചില്ലല്ലാഽക്ഷരം വരുന്നത് രണ്ടക്ഷര ദേവനാഗരി അക്ഷരകെട്ടിന് പകരമാണ്.
        elif i < len(വാചകം) - 1 and വാചകം[i:i+2] in ചില്ലല്ലാഽക്ഷരം:
            result += ചില്ലല്ലാഽക്ഷരം[വാചകം[i:i+2]]
            i += 2 #മുമ്പ് ഇത് +3 ആയിരുന്നു. എന്നിട്ട് പിന്നെ എന്ത് കൊണ്ടൊ error തന്നപ്പോൾ ഇത് മാറ്റി. എന്തെങ്കിലും അക്ഷരം തിരിച്ച് മാറ്റാത്തതുണ്ടെങ്കിൽ ഇതിനെ വീണ്ടും +3 ആക്കിയാൽ മതി.
        # ‍നുക്താക്ഷരങ്ങൾ (ജ്സ എന്നിവ) വരുന്നത് രണ്ടക്ഷര ദേവനാഗരി അക്ഷരകെട്ടിന് പകരമാണ്.
        elif i < len(വാചകം) - 1 and വാചകം[i:i+2] in നുക്താക്ഷരം:
            result += നുക്താക്ഷരം[വാചകം[i:i+2]]
            i += 2
        # സാധാരണാക്ഷരങ്ങൾക്ക്
        elif വാചകം[i] in സാധാരണാക്ഷരം:
            result += സാധാരണാക്ഷരം[വാചകം[i]]
            i += 1
        # നുക്തത്തിന്
        elif വാചകം[i] in നുക്തം:
            result += നുക്തം[വാചകം[i]]
            i += 1
        # ഒന്നും യോജിക്കുന്നില്ലെങ്കിൽ
        else:
            result += വാചകം[i]
            i += 1
    return result

def ഓല_മാഺം(നിക്ഷേപതാളി, പരിണാമതാളി):
    with open(നിക്ഷേപതാളി, 'r', encoding='utf-8') as f:
        ഉള്ളടക്കം = f.read()
    
    # മാറ്റങ്ങൾക്കു മുൻപായി അക്ഷരപെട്ടിയുടെ പേരുമാറ്റുക
    ഉള്ളടക്കം = അക്ഷരപെട്ടി_പേരുമാഺം(ഉള്ളടക്കം)
    
    # ദേവനാഗരിയെ മലയാളത്തിലേക്ക് മാറ്റൽ
    മാറ്റിയ_എഴുത്ത് = ലിപി_മാഺം(ഉള്ളടക്കം)
    
    #എല്ലാ മാറ്റങ്ങളും കഴിഞ്ഞതിന് ശേഷം വാക്യ വിരാമം (।) എന്നത് ശരിയായിടം വരുത്തിക്കാൻ. പൂർണമായും മാറില്ല, എന്തെന്നാ‍ൽ '.' കണ്ട് പിടിച്ച് മാറ്റുക എന്നത് ബുദ്ധിമുട്ടാണ്. തിരിച്ച് ചെയ്യാൻ എ‍ളുപ്പവും ആണ്.
    മാറ്റിയ_എഴുത്ത് = മാറ്റിയ_എഴുത്ത്.replace('<key code="43" output="।"/>', '<key code="43" output="."/>')
    
    #ഇത് കൂടാതെ ടിപ്പണി കൊടുത്തത് മലയാളത്തി‍ൽ നിന്ന് തന്നത്താൻ ഹിന്ദിയിലേക്ക് മാറ്റാൻ വകുപ്പുണ്ടെങ്കി‍ൽ (Google Translate API) എനിക്ക് ബുദ്ധിമുട്ടി ടിപ്പണി മുറി-സംസ്കൃതത്തി‍ൽ എഴുതേണ്ടി വരില്ല.

    with open(പരിണാമതാളി, 'w', encoding='utf-8') as f:
        f.write(മാറ്റിയ_എഴുത്ത്)

ഓല_മാഺം(നിക്ഷേപതാളി, പരിണാമതാളി)
print(f'ഓലമാഺം പൂർത്തിയായി. പരിണാമം {പരിണാമതാളി} ൽ സംരക്ഷിച്ചു.')